Функция ЗаданияБаттла() Экспорт
	
	Возврат ВыполнитьЗапрос("tasks");
		
КонецФункции            

Функция ТекущееСостояниеБаттла() Экспорт

	Возврат ВыполнитьЗапрос("state");
	
КонецФункции       

Функция УчастникиБаттла() Экспорт
	
	Возврат ВыполнитьЗапрос("competitors");	
	
КонецФункции  

Процедура НачатьРаунд(НомерРаунда, Участник, Задание) Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("round", НомерРаунда);
	Параметры.Вставить("competitor", Участник);
	Параметры.Вставить("task", Задание);
	
	ВыполнитьЗапрос("start", Параметры, Истина);
		
КонецПроцедуры

Процедура ЗавершитьРаунд(НомерРаунда, Участник, Задание) Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("round", НомерРаунда);
	Параметры.Вставить("competitor", Участник);
	Параметры.Вставить("task", Задание);
	
	ВыполнитьЗапрос("finish", Параметры, Истина);
	
КонецПроцедуры                       

Функция ТекущийБаттл() Экспорт
	
	Возврат "000000001"; // FIXME
	
КонецФункции

Функция ТипыСобытий() Экспорт

	ДоступныеТипы = Новый Структура;
	ДоступныеТипы.Вставить("НачалоРаунда", "НачалоРаунда");
	ДоступныеТипы.Вставить("ЗавершениеРаунда", "ЗавершениеРаунда");
	
	Возврат ДоступныеТипы;
	
КонецФункции

Функция АдресЭндпойнта(Знач Метод = "") Экспорт
	                                                        
	АдресСервера = Константы.АдресСервераБаттла.Получить(); 
	Возврат АдресСервера + Метод;		
		
КонецФункции      

Функция ВыполнитьЗапрос(Знач Метод, Знач ПараметрыЗапроса = Неопределено, Знач МетодPOST = Ложь)
	
	Если Не ЗначениеЗаполнено(ПараметрыЗапроса) Тогда
		ПараметрыЗапроса = Новый Структура;
	КонецЕсли;
	
	Если Не ПараметрыЗапроса.Свойство("battle") Тогда
		ПараметрыЗапроса.Вставить("battle", ТекущийБаттл());
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ПараметрыПреобразованияJSON", Новый Структура("ПрочитатьВСоответствие", Ложь));
	
	Если МетодPOST Тогда
		Ответ = Баттл_КоннекторHTTP.PostJson(АдресЭндпойнта(Метод), ПараметрыЗапроса, ДополнительныеПараметры);
	Иначе
		Ответ = Баттл_КоннекторHTTP.GetJson(АдресЭндпойнта(Метод), ПараметрыЗапроса, ДополнительныеПараметры);
	КонецЕсли;
	
	Если Ответ.Свойство("Ошибка") Тогда   
		ЗаписьЖурналаРегистрации("БаттлАналитиков", УровеньЖурналаРегистрации.Ошибка,,  Ответ.Ошибка);
		ВызватьИсключение Ответ.Ошибка;
	КонецЕсли;
	
	Если Ответ.Результат = "OK" Тогда
		Ответ.Результат = Истина;
	КонецЕсли;
	
	Возврат Ответ.Результат;
	
КонецФункции
