#Область ПрограммныйИнтерфейс

// Возвращает закодированные параметры адреса
//
// Параметры:
//   Параметры - Соответствие - Параметры запроса
//
// Возвращаемое значение:
//   Строка - Закодированные параметры адреса
//
Функция КодироватьПараметры(Параметры) Экспорт
	
	Результат = Новый Массив;
	Для Каждого Параметр Из Параметры Цикл
		
		КлючПараметра = Параметр.Ключ;
		ЗначениеПараметра = Параметр.Значение;
		
		Если ЗначениеПараметра = Неопределено Тогда
			
			Результат.Добавить(КлючПараметра);
			
		Иначе
			
			ЗначениеПараметра = КодироватьСтроку(ЗначениеПараметра, СпособКодированияСтроки.КодировкаURL);
			КлючПараметра = КодироватьСтроку(КлючПараметра, СпособКодированияСтроки.КодировкаURL);
			Результат.Добавить(СтрШаблон("%1=%2", КлючПараметра, ЗначениеПараметра));

		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СтрСоединить(Результат, "&");
	
КонецФункции

#КонецОбласти
