#Область ПрограммныйИнтерфейс

// Возвращает адрес интернет ресурса с параметрами
//
// Параметры:
//   URL - Строка - Интернет адрес 
//   Параметры - Соответствие - Параметры запроса
//
// Возвращаемое значение:
//   Строка - Адрес ресурса с параметрами
//
Функция СобратьАдресРесурса(URL, Параметры = Неопределено) Экспорт
	
	Результат = URL;
	
	Если ЗначениеЗаполнено(Параметры) Тогда
		
		Результат = Результат + "?" + КоннекторHTTPВызовСервера.КодироватьПараметры(Параметры);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
